Revit 2026 API

# IFCProductWrapperAddSpace Method

---

Adds an IfcSpace handle to associate with the IfcProduct in this wrapper.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSpace(
	IFCAnyHandle spaceHandle,
	IFCLevelInfo pLevelInfo,
	IFCExtrusionCreationData pParams,
	bool relateToLevel
)
```
```vb
Public Sub AddSpace (
	spaceHandle As IFCAnyHandle,
	pLevelInfo As IFCLevelInfo,
	pParams As IFCExtrusionCreationData,
	relateToLevel As Boolean
)
```
```cpp
public:
void AddSpace(
	IFCAnyHandle^ spaceHandle,
	IFCLevelInfo^ pLevelInfo,
	IFCExtrusionCreationData^ pParams,
	bool relateToLevel
)
```
```fsharp
member AddSpace :
        spaceHandle : IFCAnyHandle *
        pLevelInfo : IFCLevelInfo *
        pParams : IFCExtrusionCreationData *
        relateToLevel : bool -> unit
```

#### Parameters

spaceHandle IFCAnyHandle
     The IfcSpace handle.
pLevelInfo IFCLevelInfo
     Information on the associated level.
pParams IFCExtrusionCreationData
     The extrusion creation data associated with the given space. Optional, can be .
relateToLevel Boolean
     True to relate the space to the level, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.

#### Reference

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace